[
  {
    "id": "com_NX6GzO",
    "ticker": "AAPL",
    "name": "Apple Inc.",
    "lei": "HWUPKR0MPOU8FGXBT394",
    "legal_name": "Apple Inc.",
    "stock_exchange": "Nasdaq",
    "sic": 3571,
    "short_description": "Apple Inc. designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories. It also sells various related services, such as Apple Arcade, a game subscription service; Apple Music, Apple Card, Apple Pay, and Apple Card. The company serves consumers, small and mid-sized businesses; and the education, enterprise, and government markets.",
    "long_description": "Apple Inc. designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. It also sells various related services. In addition, the company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; AirPods Max, an over-ear wireless headphone; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, HomePod, and iPod touch. Further, it provides AppleCare support services; cloud services store services; and operates various platforms, including the App Store that allow customers to discover and download applications and digital content, such as books, music, video, games, and podcasts. Additionally, the company offers various services, such as Apple Arcade, a game subscription service; Apple Music, which offers users a curated listening experience with on-demand radio stations; Apple News+, a subscription news and magazine service; Apple TV+, which offers exclusive original content; Apple Card, a co-branded credit card; and Apple Pay, a cashless payment service, as well as licenses its intellectual property. The company serves consumers, and small and mid-sized businesses; and the education, enterprise, and government markets. It distributes third-party applications for its products through the App Store. The company also sells its products through its retail and online stores, and direct sales force; and third-party cellular network carriers, wholesalers, retailers, and resellers. Apple Inc. was incorporated in 1977 and is headquartered in Cupertino, California.",
    "ceo": "Timothy D. Cook",
    "company_url": "apple.com",
    "business_address": "ONE APPLE PARK WAY, CUPERTINO, CA, 95014",
    "mailing_address": "ONE APPLE PARK WAY, CUPERTINO, CA, 95014",
    "business_phone_no": "(408) 996-1010",
    "hq_address1": "1 Infinite Loop",
    "hq_address2": null,
    "hq_address_city": "Cupertino",
    "hq_address_postal_code": "95014",
    "entity_legal_form": "INCORPORATED",
    "cik": "0000320193",
    "latest_filing_date": "2024-05-02",
    "hq_state": "California",
    "hq_country": "United States of America",
    "inc_state": "California",
    "inc_country": "United States of America",
    "employees": 164000,
    "entity_status": "ACTIVE",
    "sector": "Manufacturing",
    "industry_category": "Computer Hardware",
    "industry_group": "Computer & Office Equipment",
    "template": "indu",
    "standardized_active": true,
    "first_fundamental_date": "2007-09-29",
    "last_fundamental_date": "2024-03-30",
    "first_stock_price_date": "1980-12-12",
    "last_stock_price_date": "2024-08-01",
    "thea_enabled": true,
    "legacy_sector": "Technology",
    "legacy_industry_category": "Electronics",
    "legacy_industry_group": "Diversified Electronics"
  }
]
